# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'antigen'
brew 'svn' # Needed for fonts, see: https://github.com/Homebrew/homebrew-cask/issues/80695

# Development
brew 'php'
brew 'php@7.4'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'ruby'
brew 'docker'
brew 'docker-machine'

# Utilities
brew 'legit'
brew 'tldr'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'postico'
cask 'phpstorm'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'transmit'
cask 'vagrant'
cask 'imageoptim'
cask '1password'
cask 'visual-studio-code'
cask 'hyper'
cask 'virtualbox'

# Quicklook
cask 'qlcolorcode'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack-nerd-font'
cask 'font-inter'
cask 'font-jetbrains-mono'
cask 'font-fira-code'

# Mac App Store
mas 'The Unarchiver', id: 425424353
